In [5]:
load_ext sql

In [7]:
%sql sqlite://

'Connected: @None'

In [8]:
%%sql
create table QSPL
(	SPLNO	int	primary key,
 	SPLNAME	varchar(40) not null
);

create table QITEM
(	ITEMNAME	varchar(40)	primary key,
	ITEMTYPE	char(1)		not null,
 	ITEMCOLOR	varchar(20)
);

create table QDEPT
(	DEPTNAME	varchar(15)	primary key,
 	DEPTFLOOR	integer		not null,
 	DEPTPHONE	integer		not null,
 	EMPNO		integer		not null
);

create table QEMP
(	EMPNO		integer		primary key,
 	EMPFNAME	varchar(20)	not null,
 	EMPSALARY	integer		not null,
 	DEPTNAME	varchar(15)	not null,
 	BOSSNO		integer,
constraint EmpFK1 Foreign Key(BOSSNO) references QEMP(EMPNO),
constraint EmpFK2 Foreign Key(DEPTNAME) references QDEPT(DEPTNAME)
);

create table QSALE
(	SALENO		integer		primary key,
 	SALEQTY		integer		not null,																																																																																																	
 	ITEMNAME	varchar(40)	not null,
	DEPTNAME	varchar(15)	not null,
constraint SALEFK1 Foreign Key(ITEMNAME) references QITEM(ITEMNAME),
constraint SALEFK2 Foreign Key(DEPTNAME) references QDEPT(DEPTNAME)
);
 
create table QDEL
(	DELNO		integer		primary key,
 	DELQTY		integer		not null,
 	ITEMNAME	varchar(40)	not null,
 	DEPTNAME	varchar(15)	not null,
 	SPLNO		integer		not null,
constraint DELFK1 Foreign Key(ITEMNAME) references QITEM(ITEMNAME),
constraint DELFK2 Foreign Key(DEPTNAME) references QDEPT(DEPTNAME),
constraint DELFK3 Foreign Key(SPLNO) references QSPL(SPLNO)
);

 * sqlite://
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [9]:
%%sql
insert into QDEL values (51,50,'Pocket knife-Nile','Navigation',105);
insert into QDEL values (52,10,'Pocket knife-Nile','Books',105);
insert into QDEL values (53,10,'Pocket knife-Nile','Clothes',105);
insert into QDEL values (54,10,'Pocket knife-Nile','Equipment',105);
insert into QDEL values (55,10,'Pocket knife-Nile','Furniture',105);
insert into QDEL values (56,10,'Pocket knife-Nile','Recreation',105);
insert into QDEL values (57,50,'Compass','Navigation',101);
insert into QDEL values (58,10,'Geo positioning system','Navigation',101);
insert into QDEL values (59,10,'Map measure','Navigation',101);
insert into QDEL values (60,25,'Map case','Navigation',101);
insert into QDEL values (61,2,'Sextant','Navigation',101);
insert into QDEL values (62,1,'Sextant','Equipment',105);
insert into QDEL values (63,20,'Compass','Equipment',103);
insert into QDEL values (64,1,'Geo positioning system','Books',103);
insert into QDEL values (65,15,'Map measure','Navigation',103);
insert into QDEL values (66,1,'Sextant','Books',103);
insert into QDEL values (67,5,'Sextant','Recreation',102);
insert into QDEL values (68,3,'Sextant','Navigation',104);
insert into QDEL values (69,5,'Boots-snakeproof','Clothes',105);
insert into QDEL values (70,15,'Pith helmet','Clothes',105);
insert into QDEL values (71,1,'Pith helmet','Clothes',101);
insert into QDEL values (72,1,'Pith helmet','Clothes',102);
insert into QDEL values (73,1,'Pith helmet','Clothes',103);
insert into QDEL values (74,1,'Pith helmet','Clothes',104);
insert into QDEL values (75,5,'Pith helmet','Navigation',105);
insert into QDEL values (76,5,'Pith helmet','Books',105);
insert into QDEL values (77,5,'Pith helmet','Equipment',105);
insert into QDEL values (78,5,'Pith helmet','Furniture',105);
insert into QDEL values (79,5,'Pith helmet','Recreation',105);
insert into QDEL values (80,10,'Pocket knife-Nile','Navigation',102);
insert into QDEL values (81,1,'Compass','Navigation',102);
insert into QDEL values (82,1,'Geo positioning system','Navigation',102);
insert into QDEL values (83,10,'Map measure','Navigation',102);
insert into QDEL values (84,5,'Map case','Navigation',102);
insert into QDEL values (85,5,'Compass','Books',102);
insert into QDEL values (86,5,'Pocket knife-Avon','Recreation',102);
insert into QDEL values (87,5,'Tent-2 person','Recreation',102);
insert into QDEL values (88,2,'Tent-2 person','Recreation',102);
insert into QDEL values (89,5,'Exploring in 10 Easy Lessons','Navigation',102);
insert into QDEL values (90,5,'How to Win Foreign Friends','Navigation',102);
insert into QDEL values (91,10,'Exploring in 10 Easy Lessons','Books',102);
insert into QDEL values (92,10,'How to Win Foreign Friends','Books',102);
insert into QDEL values (93,2,'Exploring in 10 Easy Lessons','Recreation',102);
insert into QDEL values (94,2,'How to Win Foreign Friends','Recreation',102);
insert into QDEL values (95,5,'Compass','Equipment',105);
insert into QDEL values (96,2,'Boots-snakeproof','Equipment',105);
insert into QDEL values (97,20,'Pith helmet','Equipment',106);
insert into QDEL values (98,20,'Pocket knife-Nile','Equipment',106);
insert into QDEL values (99,1,'Sextant','Equipment',106);
insert into QDEL values (100,3,'Hat-polar explorer','Clothes',105);
insert into QDEL values (101,3,'Stetson','Clothes',105);

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [10]:
%%sql
insert into QDEPT values('Management',5,34,1);
insert into QDEPT values('Books',1,81,4);
insert into QDEPT values('Clothes',2,24,4);
insert into QDEPT values('Equipment',3,57,3);
insert into QDEPT values('Furniture',4,14,3);
insert into QDEPT values('Navigation',1,41,3);
insert into QDEPT values('Recreation',2,29,4);
insert into QDEPT values('Accounting',5,35,5);
insert into QDEPT values('Purchasing',5,36,7);
insert into QDEPT values('Personnel',5,37,9);
insert into QDEPT values('Marketing',5,38,2);

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [11]:
%%sql
insert into QEMP values(1,'Alice',75000,'Management', NULL);
insert into QEMP values(2,'Ned',45000,'Marketing',1);
insert into QEMP values(3,'Andrew',25000,'Marketing',2);
insert into QEMP values(4,'Clare',22000,'Marketing',2);
insert into QEMP values(5,'Todd',38000,'Accounting',1);
insert into QEMP values(6,'Nancy',22000,'Accounting',5);
insert into QEMP values(7,'Brier',43000,'Purchasing',1);
insert into QEMP values(8,'Sarah',56000,'Purchasing',7);
insert into QEMP values(9,'Sophie',35000,'Personnel',1);
insert into QEMP values(10,'Sanjay',15000,'Navigation',3);
insert into QEMP values(11,'Rita',15000,'Books',4);
insert into QEMP values(12,'Gigi',16000,'Clothes',4);
insert into QEMP values(13,'Maggie',16000,'Clothes',4);
insert into QEMP values(14,'Paul',11000,'Equipment',3);
insert into QEMP values(15,'James',15000,'Equipment',3);
insert into QEMP values(16,'Pat',15000,'Furniture',3);
insert into QEMP values(17,'Mark',15000,'Recreation',3);

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [12]:
%%sql
insert into QITEM values('Boots-snakeproof' , 'C', 'Green');
insert into QITEM values('Camel saddle', 'R', 'Brown');
insert into QITEM values('Compass', 'N', NULL);
insert into QITEM values('Elephant polo stick', 'R', 'Bamboo');
insert into QITEM values('Exploring in 10 Easy Lessons', 'B', NULL);
insert into QITEM values('Geo positioning system', 'N', NULL);
insert into QITEM values('Hammock', 'F', 'Khaki');
insert into QITEM values('Hat-polar explorer', 'C', 'White');
insert into QITEM values('How to Win Foreign Friends', 'B', NULL);
insert into QITEM values('Map case', 'E', 'Brown');
insert into QITEM values('Map measure', 'N',  NULL);
insert into QITEM values('Pith helmet', 'C', 'Khaki');
insert into QITEM values('Pocket knife-Avon',  'E', 'Brown');
insert into QITEM values('Pocket knife-Nile',  'E',  'Brown');
insert into QITEM values('Safari chair',  'F', 'Khaki');
insert into QITEM values('Safari cooking kit', 'F', NULL);
insert into QITEM values('Sextant', 'N', NULL);
insert into QITEM values('Stetson',  'C', 'Black');
insert into QITEM values('Tent-2 person', 'F', 'Khaki');
insert into QITEM values('Tent-8 person', 'F', 'Khaki');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [13]:
%%sql
insert into QSPL values(101, 'Global Books & Maps');
insert into QSPL values(102,  'Nepalese Corp.');
insert into QSPL values(103 , 'All Sports Manufacturing');
insert into QSPL values(104, 'Sweatshops Unlimited');
insert into QSPL values(105, 'All Points, Inc.');
insert into QSPL values(106, 'Sao Paulo Manufacturing');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [14]:
%%sql
insert into QSALE values (1001,2,'Boots-snakeproof', 'Clothes');
insert into QSALE values (1002,1,'Pith helmet','Clothes');
insert into QSALE values (1003,1,'Sextant','Navigation');
insert into QSALE values (1004,3,'Hat-polar explorer','Clothes');
insert into QSALE values (1005,5,'Pith helmet','Equipment');
insert into QSALE values (1006,1,'Pocket knife-Nile','Clothes');
insert into QSALE values (1007,1,'Pocket knife-Nile','Recreation');
insert into QSALE values (1008,1,'Compass','Navigation');
insert into QSALE values (1009,1,'Geo positioning system','Navigation');
insert into QSALE values (1010,5,'Map measure','Navigation');
insert into QSALE values (1011,1,'Geo positioning system','Books');
insert into QSALE values (1012,1,'Sextant','Books');
insert into QSALE values (1013,3,'Pocket knife-Nile','Books');
insert into QSALE values (1014,1,'Pocket knife-Nile','Navigation');
insert into QSALE values (1015,1,'Pocket knife-Nile','Equipment');
insert into QSALE values (1016,1,'Sextant','Clothes');
insert into QSALE values (1017,1,'Sextant','Equipment');
insert into QSALE values (1018,1,'Sextant','Recreation');
insert into QSALE values (1019,1,'Sextant','Furniture');
insert into QSALE values (1020,1,'Pocket knife-Nile','Furniture');
insert into QSALE values (1021,1,'Exploring in 10 Easy Lessons','Books');
insert into QSALE values (1022,1,'How to Win Foreign Friends','Books');
insert into QSALE values (1023,1,'Compass','Books');
insert into QSALE values (1024,1,'Pith helmet','Books');
insert into QSALE values (1025,1,'Elephant polo stick','Recreation');
insert into QSALE values (1026,1,'Camel saddle','Recreation');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

1. Find the names of employees in the MKT department

In [16]:
%%sql
SELECT EMPFNAME FROM QEMP
WHERE DEPTNAME = 'Marketing';

 * sqlite://
Done.

[('Ned',), ('Andrew',), ('Clare',)]

2. Return the names of the items sold by a department on the second floor.

(1) IN

In [25]:
%%sql
SELECT ITEMNAME FROM QSALE
WHERE DEPTNAME IN
    (SELECT DEPTNAME FROM QDEPT WHERE DEPTFLOOR = 2);

 * sqlite://
Done.

[('Boots-snakeproof',),
 ('Pith helmet',),
 ('Hat-polar explorer',),
 ('Pocket knife-Nile',),
 ('Pocket knife-Nile',),
 ('Sextant',),
 ('Sextant',),
 ('Elephant polo stick',),
 ('Camel saddle',)]

(2) Join

In [26]:
%%sql
SELECT ITEMNAME FROM QSALE s, QDEPT d
WHERE s.DEPTNAME = d.DEPTNAME
AND d.DEPTFLOOR = 2;

 * sqlite://
Done.

[('Boots-snakeproof',),
 ('Pith helmet',),
 ('Hat-polar explorer',),
 ('Pocket knife-Nile',),
 ('Pocket knife-Nile',),
 ('Sextant',),
 ('Sextant',),
 ('Elephant polo stick',),
 ('Camel saddle',)]

(3) Correlated subquery

In [28]:
%%sql
SELECT ITEMNAME FROM QSALE s
WHERE DEPTNAME IN (
    SELECT DEPTNAME FROM QDEPT e
    WHERE s.DEPTNAME = e.DEPTNAME
    AND e.DEPTFLOOR = 2);

 * sqlite://
Done.

[('Boots-snakeproof',),
 ('Pith helmet',),
 ('Hat-polar explorer',),
 ('Pocket knife-Nile',),
 ('Pocket knife-Nile',),
 ('Sextant',),
 ('Sextant',),
 ('Elephant polo stick',),
 ('Camel saddle',)]

(4) Exists

In [31]:
%%sql
SELECT DISTINCT ITEMNAME FROM QSALE
WHERE EXISTS
    (SELECT * FROM QDEPT
    WHERE QSALE.DEPTNAME = QDEPT.DEPTNAME AND DEPTFLOOR = 2);

 * sqlite://
Done.

[('Boots-snakeproof',),
 ('Pith helmet',),
 ('Hat-polar explorer',),
 ('Pocket knife-Nile',),
 ('Sextant',),
 ('Elephant polo stick',),
 ('Camel saddle',)]

3. Find the names of items sold on floors other than the second floor.

In [34]:
%%sql
SELECT DISTINCT ITEMNAME FROM QSALE
WHERE DEPTNAME NOT IN (
    SELECT DEPTNAME FROM QDEPT WHERE DEPTFLOOR = 2)
ORDER BY ITEMNAME;

 * sqlite://
Done.

[('Compass',),
 ('Exploring in 10 Easy Lessons',),
 ('Geo positioning system',),
 ('How to Win Foreign Friends',),
 ('Map measure',),
 ('Pith helmet',),
 ('Pocket knife-Nile',),
 ('Sextant',)]

4. Find the names of the sold items that are not sold by any department on the second floor.

In [35]:
%%sql
SELECT DISTINCT ITEMNAME FROM QSALE
WHERE ITEMNAME NOT IN (
    SELECT DISTINCT ITEMNAME FROM QSALE, QDEPT
    WHERE QSALE.DEPTNAME = QDEPT.DEPTNAME AND DEPTFLOOR = 2);

 * sqlite://
Done.

[('Compass',),
 ('Geo positioning system',),
 ('Map measure',),
 ('Exploring in 10 Easy Lessons',),
 ('How to Win Foreign Friends',)]

5. Find the items sold by all departments on the second floor.

In [39]:
%%sql
SELECT QSALE.ITEMNAME FROM QSALE, QDEPT
WHERE QSALE.DEPTNAME = QDEPT.DEPTNAME AND QDEPT.DEPTFLOOR = 2
GROUP BY QSALE.ITEMNAME
HAVING COUNT(DISTINCT QDEPT.DEPTNAME) = 
    (SELECT COUNT(DISTINCT DEPTNAME) FROM QDEPT WHERE DEPTFLOOR = 2);

 * sqlite://
Done.

[('Pocket knife-Nile',), ('Sextant',)]

6. Find the items sold by at least two departments on the second floor.

In [41]:
%%sql
SELECT QSALE.ITEMNAME FROM QSALE, QDEPT
WHERE QSALE.DEPTNAME = QDEPT.DEPTNAME AND QDEPT.DEPTFLOOR = 2
GROUP BY QSALE.ITEMNAME
HAVING COUNT(DISTINCT QDEPT.DEPTNAME) >= 2;

 * sqlite://
Done.

[('Pocket knife-Nile',), ('Sextant',)]

7. Find the salary of Clare's manager.

In [48]:
%%sql
SELECT EMPFNAME,EMPSALARY FROM QEMP
WHERE EMPNO = (
    SELECT BOSSNO FROM QEMP WHERE EMPFNAME = 'Clare');

 * sqlite://
Done.

[('Ned', 45000)]

8. Find numbers and names of those employees who make more than their manager.

In [58]:
%%sql
SELECT DISTINCT q1.EMPFNAME 'Emp' 
FROM QEMP q1, QEMP q2 WHERE q1.BOSSNO = q2.EMPNO
AND q1.EMPSALARY > q2.EMPSALARY;

 * sqlite://
Done.

[('Sarah',)]

9. Find the departments where all the employees earn less thier manager (Note: Management Dept does not have any boss)

In [68]:
%%sql
SELECT DISTINCT DEPTNAME FROM QEMP WHERE DEPTNAME <> 'Management' AND
DEPTNAME NOT IN
(
SELECT DISTINCT q1.DEPTNAME
FROM QEMP q1, QEMP q2 
WHERE q1.BOSSNO = q2.EMPNO
AND q1.EMPSALARY > q2.EMPSALARY) 
ORDER BY DEPTNAME;

 * sqlite://
Done.

[('Accounting',),
 ('Books',),
 ('Clothes',),
 ('Equipment',),
 ('Furniture',),
 ('Marketing',),
 ('Navigation',),
 ('Personnel',),
 ('Recreation',)]

10. Return EMPNO, EMPNAME of each manager, and number of employees she/he manages directly (Employee A is deirct employee of Manager B if and only if B is A's boss)

In [81]:
%%sql
SELECT q2.EMPFNAME 'Boss', COUNT(q1.EMPFNAME)
FROM QEMP q1, QEMP q2 WHERE q1.BOSSNO = q2.EMPNO
GROUP BY q2.EMPFNAME
ORDER BY q2.EMPFNAME;

 * sqlite://
Done.

[('Alice', 4),
 ('Andrew', 5),
 ('Brier', 1),
 ('Clare', 3),
 ('Ned', 2),
 ('Todd', 1)]

11. Find the names of employees who are in the same department as their manager (as an employee). Report the name of the employee, the department, and the boss's name.

In [86]:
%%sql
SELECT q1.EMPFNAME 'Staff', q2.EMPFNAME 'Boss', q1.DEPTNAME 'Department'
FROM QEMP q1, QEMP q2 WHERE q1.BOSSNO = q2.EMPNO
AND q1.DEPTNAME = q2.DEPTNAME;

 * sqlite://
Done.

[('Andrew', 'Ned', 'Marketing'),
 ('Clare', 'Ned', 'Marketing'),
 ('Nancy', 'Todd', 'Accounting'),
 ('Sarah', 'Brier', 'Purchasing')]

12. List DEPTNAME and the average salary of those departments having an average salary over $25,000.

In [89]:
%%sql
SELECT DEPTNAME, AVG(EMPSALARY) FROM QEMP 
GROUP BY DEPTNAME
HAVING AVG(EMPSALARY) > 25000;

 * sqlite://
Done.

[('Accounting', 30000.0),
 ('Management', 75000.0),
 ('Marketing', 30666.666666666668),
 ('Personnel', 35000.0),
 ('Purchasing', 49500.0)]

13. List the departments where the average salary of the non-manager employees is more than $25,000 (the manager employee of a department refers to the employee listed under EMPNO column of QDEPT table, for example, employee with EMPNO = 4 is the manager of BOOKS department).

In [91]:
%%sql
SELECT WRK.DEPTNAME, AVG(WRK.EMPSALARY)
FROM QEMP WRK
WHERE WRK.EMPNO NOT IN
(SELECT QDEPT.EMPNO FROM QDEPT
WHERE WRK.DEPTNAME = QDEPT.DEPTNAME)
GROUP BY WRK.DEPTNAME
HAVING AVG(WRK.EMPSALARY) > 25000;

 * sqlite://
Done.

[('Purchasing', 56000.0)]

14. List the name and salary of the managers who manage more than two employees.

In [94]:
%%sql
SELECT q2.EMPFNAME, q2.EMPSALARY
FROM QEMP q1, QEMP q2
WHERE q1.BOSSNO = q2.EMPNO
GROUP BY q1.BOSSNO
HAVING COUNT(q1.EMPNO) > 2;

 * sqlite://
Done.

[('Alice', 75000), ('Andrew', 25000), ('Clare', 22000)]

In [95]:
%%sql
SELECT EMPFNAME, EMPSALARY FROM QEMP
WHERE EMPNO IN
(SELECT BOSSNO FROM QEMP
GROUP BY BOSSNO HAVING COUNT(*) > 2);

 * sqlite://
Done.

[('Alice', 75000), ('Andrew', 25000), ('Clare', 22000)]

15. List the name, salary, and manager of the employees of the Marketing department who have a salary over $25,000.

In [98]:
%%sql
SELECT WRK.EMPFNAME, WRK.EMPSALARY, BOSS.EMPFNAME
FROM QEMP WRK, QEMP BOSS
WHERE WRK.BOSSNO = BOSS.EMPNO
AND WRK.DEPTNAME = 'Marketing' AND WRK.EMPSALARY > 25000;

 * sqlite://
Done.

[('Ned', 45000, 'Alice')]

16. List the names of the employees who earn more than any employee in the Marketing department.

In [104]:
%%sql
SELECT EMPFNAME FROM QEMP
WHERE EMPSALARY > (
    SELECT MAX(EMPSALARY)
    FROM QEMP
    WHERE DEPTNAME = 'Marketing');

 * sqlite://
Done.

[('Alice',), ('Sarah',)]

17. Among all the departments with total salary greater than $25,000, find DEPTNAME of those departments that sell Pocket knife-Nile.

In [118]:
%%sql
SELECT DISTINCT DEPTNAME
FROM QEMP
WHERE DEPTNAME IN
        (SELECT DEPTNAME
        FROM QSALE
         WHERE ITEMNAME = 'Pocket knife-Nile')
GROUP by DEPTNAME
HAVING SUM(EMPSALARY) > 25000;

 * sqlite://
Done.

[('Clothes',), ('Equipment',)]

In [110]:
%%sql
SELECT DISTINCT DEPTNAME FROM QSALE
WHERE ITEMNAME = 'Pocket knife-Nile' AND DEPTNAME IN
(SELECT DEPTNAME FROM QEMP
GROUP BY DEPTNAME HAVING SUM(EMPSALARY) > 25000);

 * sqlite://
Done.

[('Clothes',), ('Equipment',)]

19. Find SPLNO and SPLNAME of those suppliers that deliver compasses.

In [123]:
%%sql
SELECT DISTINCT QDEL.SPLNO, SPLNAME FROM QSPL, QDEL
WHERE QSPL.SPLNO = QDEL.SPLNO and ITEMNAME = 'Compass';

 * sqlite://
Done.

[(101, 'Global Books & Maps'),
 (103, 'All Sports Manufacturing'),
 (102, 'Nepalese Corp.'),
 (105, 'All Points, Inc.')]

20. Find the suppliers that do not deliver compasses.

In [124]:
%%sql
SELECT SPLNO, SPLNAME FROM QSPL
WHERE SPLNO NOT IN
(SELECT SPLNO FROM QDEL WHERE ITEMNAME = 'Compass');

 * sqlite://
Done.

[(104, 'Sweatshops Unlimited'), (106, 'Sao Paulo Manufacturing')]

21. Find the SPLNO and SPLNAME of all the suppliers that deliver both 'compass' and an item other than 'compass'.

In [137]:
%%sql
SELECT DISTINCT d.SPLNO, s.SPLNAME
FROM QDEL d,QSPL s
WHERE d.SPLNO = s.SPLNO AND
d.ITEMNAME <> 'Compass' AND
d.SPLNO IN
(SELECT SPLNO FROM QDEL WHERE ITEMNAME = 'Compass');

 * sqlite://
Done.

[(105, 'All Points, Inc.'),
 (101, 'Global Books & Maps'),
 (103, 'All Sports Manufacturing'),
 (102, 'Nepalese Corp.')]

In [139]:
%%sql
SELECT * FROM QSPL
WHERE SPLNO IN (SELECT SPLNO FROM QDEL WHERE ITEMNAME = 'Compass')
AND SPLNO IN (SELECT SPLNO FROM QDEL WHERE ITEMNAME <> 'Compass');

 * sqlite://
Done.

[(101, 'Global Books & Maps'),
 (102, 'Nepalese Corp.'),
 (103, 'All Sports Manufacturing'),
 (105, 'All Points, Inc.')]

In [140]:
%%sql
SELECT DISTINCT QDEL.SPLNO, SPLNAME FROM QSPL, QDEL
WHERE QDEL.SPLNO = QSPL.SPLNO
AND QDEL.SPLNO IN
(SELECT SPLNO 
 FROM QDEL 
 WHERE ITEMNAME = 'Compass')
    GROUP BY QDEL.SPLNO, SPLNAME 
    HAVING COUNT(DISTINCT ITEMNAME) > 1;

 * sqlite://
Done.

[(101, 'Global Books & Maps'),
 (102, 'Nepalese Corp.'),
 (103, 'All Sports Manufacturing'),
 (105, 'All Points, Inc.')]

22.List SPLNO and SPLNAME of all the suppliers that deliver at least two items of type N.

In [150]:
%%sql
SELECT DISTINCT d.SPLNO, s. SPLNAME
FROM QDEL d, QSPL s
WHERE d.SPLNO = s.SPLNO
AND ITEMNAME IN (
    SELECT ITEMNAME FROM QITEM
    WHERE ITEMTYPE = 'N')
GROUP BY d.SPLNO
HAVING COUNT(ITEMNAME) > 2;

 * sqlite://
Done.

[(101, 'Global Books & Maps'),
 (102, 'Nepalese Corp.'),
 (103, 'All Sports Manufacturing')]

23. List ITEMNAME of all the items delivered by exactly one supplier (i.e., list the items always delivered by the same supplier).

In [153]:
%%sql
SELECT DISTINCT ITEMNAME
FROM QDEL
GROUP BY ITEMNAME
HAVING COUNT(DISTINCT SPLNO) = 1;

 * sqlite://
Done.

[('Boots-snakeproof',),
 ('Exploring in 10 Easy Lessons',),
 ('Hat-polar explorer',),
 ('How to Win Foreign Friends',),
 ('Pocket knife-Avon',),
 ('Stetson',),
 ('Tent-2 person',)]

24. Find all the pairs of supplier (SPLNO, SPLNAME) and item  (ITEMNAME) such that the supplier is the only supplier of that item.

In [163]:
%%sql
SELECT DISTINCT d.SPLNO, s.SPLNAME, d.ITEMNAME
FROM QDEL d, QSPL s
WHERE d.SPLNO = s.SPLNO AND d.ITEMNAME IN (
    SELECT ITEMNAME
    FROM QDEL
    GROUP BY ITEMNAME
    HAVING COUNT(DISTINCT SPLNO) = 1)
ORDER BY d.SPLNO, d.ITEMNAME;

 * sqlite://
Done.

[(102, 'Nepalese Corp.', 'Exploring in 10 Easy Lessons'),
 (102, 'Nepalese Corp.', 'How to Win Foreign Friends'),
 (102, 'Nepalese Corp.', 'Pocket knife-Avon'),
 (102, 'Nepalese Corp.', 'Tent-2 person'),
 (105, 'All Points, Inc.', 'Boots-snakeproof'),
 (105, 'All Points, Inc.', 'Hat-polar explorer'),
 (105, 'All Points, Inc.', 'Stetson')]

In [164]:
%%sql
SELECT DISTINCT QSPL.SPLNO, SPLNAME, ITEMNAME
FROM QSPL, QDEL DEL1
WHERE QSPL.SPLNO = DEL1.SPLNO
AND ITEMNAME NOT IN
(SELECT ITEMNAME FROM QDEL
WHERE QDEL.SPLNO <> DEL1.SPLNO)

 * sqlite://
Done.

[(105, 'All Points, Inc.', 'Boots-snakeproof'),
 (102, 'Nepalese Corp.', 'Pocket knife-Avon'),
 (102, 'Nepalese Corp.', 'Tent-2 person'),
 (102, 'Nepalese Corp.', 'Exploring in 10 Easy Lessons'),
 (102, 'Nepalese Corp.', 'How to Win Foreign Friends'),
 (105, 'All Points, Inc.', 'Hat-polar explorer'),
 (105, 'All Points, Inc.', 'Stetson')]

25. List the suppliers that deliver at least 10 items.

In [170]:
%%sql
SELECT QSPL.SPLNAME
FROM QSPL, QDEL
WHERE QSPL.SPLNO = QDEL.SPLNO
GROUP BY QSPL.SPLNO
HAVING COUNT(DISTINCT QDEL.ITEMNAME )> 10;

 * sqlite://
Done.

[('Nepalese Corp.',)]

26. For each item, list ITEMNAME, ITEMTYPE, DEPTNAME of departments that sell the item, and the floor location of these departments.

In [172]:
%%sql
SELECT QITEM.ITEMNAME, ITEMTYPE, QDEPT.DEPTNAME, DEPTFLOOR
FROM QITEM, QSALE, QDEPT
WHERE QSALE.ITEMNAME = QITEM.ITEMNAME 
AND QSALE.DEPTNAME = QDEPT.DEPTNAME

 * sqlite://
Done.

[('Boots-snakeproof', 'C', 'Clothes', 2),
 ('Pith helmet', 'C', 'Clothes', 2),
 ('Sextant', 'N', 'Navigation', 1),
 ('Hat-polar explorer', 'C', 'Clothes', 2),
 ('Pith helmet', 'C', 'Equipment', 3),
 ('Pocket knife-Nile', 'E', 'Clothes', 2),
 ('Pocket knife-Nile', 'E', 'Recreation', 2),
 ('Compass', 'N', 'Navigation', 1),
 ('Geo positioning system', 'N', 'Navigation', 1),
 ('Map measure', 'N', 'Navigation', 1),
 ('Geo positioning system', 'N', 'Books', 1),
 ('Sextant', 'N', 'Books', 1),
 ('Pocket knife-Nile', 'E', 'Books', 1),
 ('Pocket knife-Nile', 'E', 'Navigation', 1),
 ('Pocket knife-Nile', 'E', 'Equipment', 3),
 ('Sextant', 'N', 'Clothes', 2),
 ('Sextant', 'N', 'Equipment', 3),
 ('Sextant', 'N', 'Recreation', 2),
 ('Sextant', 'N', 'Furniture', 4),
 ('Pocket knife-Nile', 'E', 'Furniture', 4),
 ('Exploring in 10 Easy Lessons', 'B', 'Books', 1),
 ('How to Win Foreign Friends', 'B', 'Books', 1),
 ('Compass', 'N', 'Books', 1),
 ('Pith helmet', 'C', 'Books', 1),
 ('Elephant polo stick', 'R', 'Recreation', 2),
 ('Camel saddle', 'R', 'Recreation', 2)]

27. List ITEMNAME of each item delivered to at least two departments by each supplier that delivers it.

In [191]:
%%sql
SELECT DISTINCT ITEMNAME, COUNT(DEPTNAME) FROM QDEL
GROUP BY ITEMNAME, SPLNO
HAVING COUNT(DISTINCT DEPTNAME) >= 2;

 * sqlite://
Done.

[('Boots-snakeproof', 2),
 ('Compass', 2),
 ('Exploring in 10 Easy Lessons', 3),
 ('How to Win Foreign Friends', 3),
 ('Pith helmet', 6),
 ('Pocket knife-Nile', 6)]

In [198]:
%%sql
SELECT DISTINCT ITEMNAME FROM QDEL
WHERE ITEMNAME NOT IN
(SELECT ITEMNAME FROM QDEL
GROUP BY ITEMNAME, SPLNO
HAVING COUNT(DISTINCT DEPTNAME) < 2);

 * sqlite://
Done.

[('Boots-snakeproof',),
 ('Exploring in 10 Easy Lessons',),
 ('How to Win Foreign Friends',)]

28. List the items delivered by Nepalese Corp. and sold in the Navigation department.

In [201]:
%%sql
SELECT DISTINCT ITEMNAME FROM QITEM
WHERE ITEMNAME IN
(SELECT ITEMNAME FROM QDEL, QSPL
WHERE QDEL.SPLNO = QSPL.SPLNO AND SPLNAME = 'Nepalese Corp.')
AND ITEMNAME IN
(SELECT ITEMNAME FROM QSALE
WHERE DEPTNAME = 'Navigation');

 * sqlite://
Done.

[('Compass',),
 ('Geo positioning system',),
 ('Map measure',),
 ('Pocket knife-Nile',),
 ('Sextant',)]

29. List ITEMNAME f all the items delivered by Nepalese Corp. or sold in the Navigation department.

In [202]:
%%sql
SELECT ITEMNAME FROM QDEL, QSPL WHERE QDEL.SPLNO = QSPL.SPLNO AND SPLNAME = 'Nepalese corp.'
UNION
SELECT ITEMNAME FROM QSALE WHERE DEPTNAME = 'Navigation';

 * sqlite://
Done.

[('Compass',),
 ('Geo positioning system',),
 ('Map measure',),
 ('Pocket knife-Nile',),
 ('Sextant',)]

In [203]:
%%sql
SELECT DISTINCT ITEMNAME FROM QITEM
WHERE ITEMNAME IN
(SELECT ITEMNAME FROM QDEL, QSPL
WHERE QDEL.SPLNO = QSPL.SPLNO AND SPLNAME = 'Nepalese corp.')
OR ITEMNAME IN
(SELECT ITEMNAME FROM QSALE
WHERE DEPTNAME = 'Navigation');

 * sqlite://
Done.

[('Compass',),
 ('Geo positioning system',),
 ('Map measure',),
 ('Pocket knife-Nile',),
 ('Sextant',)]

30. List DEPTNAME of all the departments selling items of type E that are delivered by Nepalese Corp, or selling items that are sold by the Navigation department.

In [213]:
%%sql
SELECT DISTINCT DEPTNAME
FROM QSALE
WHERE ITEMNAME IN (
    SELECT ITEMNAME FROM QITEM WHERE ITEMTYPE = 'E' AND
    ITEMNAME IN (
        SELECT ITEMNAME FROM QDEL, QSPL WHERE QDEL.SPLNO = QSPL.SPLNO
        AND QSPL.SPLNAME = 'Nepaless corp')
    OR ITEMNAME IN (
        SELECT ITEMNAME FROM QSALE WHERE DEPTNAME = 'Navigation'))
ORDER BY DEPTNAME;

 * sqlite://
Done.

[('Books',),
 ('Clothes',),
 ('Equipment',),
 ('Furniture',),
 ('Navigation',),
 ('Recreation',)]

31. Find the average salary of the employees in the Clothes department.

In [214]:
%%sql
SELECT AVG(EMPSALARY) FROM QEMP
WHERE DEPTNAME = 'Clothes';

 * sqlite://
Done.

[(16000.0,)]

32. Find, for each department, the average salary of the employees.

In [215]:
%%sql
SELECT DEPTNAME, AVG(EMPSALARY)
FROM QEMP
GROUP BY DEPTNAME

 * sqlite://
Done.

[('Accounting', 30000.0),
 ('Books', 15000.0),
 ('Clothes', 16000.0),
 ('Equipment', 13000.0),
 ('Furniture', 15000.0),
 ('Management', 75000.0),
 ('Marketing', 30666.666666666668),
 ('Navigation', 15000.0),
 ('Personnel', 35000.0),
 ('Purchasing', 49500.0),
 ('Recreation', 15000.0)]

33. Find, for each department on the second floor, the average salary of the employees.

In [216]:
%%sql
SELECT QDEPT.DEPTNAME, AVG(EMPSALARY) FROM QEMP, QDEPT
WHERE QEMP.DEPTNAME = QDEPT.DEPTNAME AND DEPTFLOOR = 2
GROUP BY QDEPT.DEPTNAME

 * sqlite://
Done.

[('Clothes', 16000.0), ('Recreation', 15000.0)]

34. Find, for each department that sells items of type E, the average salary of the employees.

In [217]:
%%sql
SELECT DEPTNAME, AVG(EMPSALARY)
FROM QEMP
WHERE DEPTNAME IN (
    SELECT DEPTNAME FROM QDEPT WHERE DEPTNAME IN (
        SELECT DEPTNAME FROM QDEL WHERE ITEMNAME IN (
            SELECT ITEMNAME FROM QITEM WHERE ITEMTYPE = 'E')))
GROUP BY DEPTNAME;

 * sqlite://
Done.

[('Books', 15000.0),
 ('Clothes', 16000.0),
 ('Equipment', 13000.0),
 ('Furniture', 15000.0),
 ('Navigation', 15000.0),
 ('Recreation', 15000.0)]

35. Find the total number of items of type E sold by the departments on the second floor.

In [219]:
%%sql
SELECT SUM(SALEQTY) AS SMUQTY FROM QITEM, QSALE, QDEPT
WHERE QITEM.ITEMNAME = QSALE.ITEMNAME
AND QDEPT.DEPTNAME = QSALE.DEPTNAME
AND ITEMTYPE = 'e' AND DEPTFLOOR = 2;

 * sqlite://
Done.

[(None,)]

36. Find those items sold by the departments on the second floor. For each such an item, list ITEMNAME and the total quantity sold by the departments on the second floor.

In [221]:
%%sql
SELECT QITEM.ITEMNAME, SUM(SALEQTY) AS SMUQTY  FROM QITEM, QSALE, QDEPT
WHERE QITEM.ITEMNAME = QSALE.ITEMNAME
AND QDEPT.DEPTNAME = QSALE.DEPTNAME
AND DEPTFLOOR = 2
GROUP BY QITEM.ITEMNAME;

 * sqlite://
Done.

[('Boots-snakeproof', 2),
 ('Camel saddle', 1),
 ('Elephant polo stick', 1),
 ('Hat-polar explorer', 3),
 ('Pith helmet', 1),
 ('Pocket knife-Nile', 2),
 ('Sextant', 2)]

37. List SPLNO and SPLNAME of those suppliers that deliver a total quantity of items of types C and N that is altogether greater than 50.

In [228]:
%%sql
SELECT QDEL.SPLNO, QSPL.SPLNAME
FROM QDEL, QSPL
WHERE QDEL.SPLNO = QSPL.SPLNO AND
    ITEMNAME IN (
        SELECT ITEMNAME FROM QITEM WHERE ITEMTYPE IN ('C', 'N'))
GROUP BY QDEL.SPLNO
HAVING SUM(DELQTY) > 50;

 * sqlite://
Done.

[(101, 'Global Books & Maps'), (105, 'All Points, Inc.')]

38. What is, for each supplier, the average number of items per department that the supplier delivers?

In [231]:
%%sql
SELECT SPLNO, DEPTNAME, AVG(DELQTY)
FROM QDEL
GROUP BY SPLNO, DEPTNAME
ORDER BY DEPTNAME;

 * sqlite://
Done.

[(102, 'Books', 8.333333333333334),
 (103, 'Books', 1.0),
 (105, 'Books', 7.5),
 (101, 'Clothes', 1.0),
 (102, 'Clothes', 1.0),
 (103, 'Clothes', 1.0),
 (104, 'Clothes', 1.0),
 (105, 'Clothes', 7.2),
 (103, 'Equipment', 20.0),
 (105, 'Equipment', 4.6),
 (106, 'Equipment', 13.666666666666666),
 (105, 'Furniture', 7.5),
 (101, 'Navigation', 19.4),
 (102, 'Navigation', 5.285714285714286),
 (103, 'Navigation', 15.0),
 (104, 'Navigation', 3.0),
 (105, 'Navigation', 27.5),
 (102, 'Recreation', 3.5),
 (105, 'Recreation', 7.5)]

39. For each department, find the average salary of the employees who earn more than the average salary of the department.

In [236]:
%%sql
SELECT q1.DEPTNAME, AVG(q1.EMPSALARY)
FROM QEMP q1
WHERE q1.EMPSALARY > (
    SELECT AVG(q2.EMPSALARY)
    FROM QEMP q2
    WHERE q2.DEPTNAME = q1.DEPTNAME)
GROUP BY q1.DEPTNAME

 * sqlite://
Done.

[('Accounting', 38000.0),
 ('Equipment', 15000.0),
 ('Marketing', 45000.0),
 ('Purchasing', 56000.0)]

40. Give the overall average of the salaries in all departments.

In [224]:
%%sql
SELECT AVG(EMPSALARY) FROM QEMP;

 * sqlite://
Done.

[(28176.470588235294,)]